Repository: adventam10/ExpenseLog
Catalog: ExpenseLog/ExpenseLog/Resoureces/Localizable.xcstrings
Source language: en
Languages: ja

# add_button_title
source: Add
ja: 追加

# alert_error_title
source: Error
ja: エラー

# alert_register_items_empty
source: Please add the registration data.
ja: 登録データを追加してください。

# alert_registered_message
source: Registration completed.
ja: 登録が完了しました。

# api_error_message_network
source: Communication failed. Please check your internet connection and try again.
ja: 通信に失敗しました。インターネット接続をご確認のうえ、再度お試しください。

# api_error_message_server
source: Communication failed. Please wait for a while and try again later due to an issue with the server."
ja: 通信に失敗しました。サーバーに問題があるためしばらく時間をおいて再試行してください。

# app_update_message
source: Please update the app.
ja: アプリをアップデートしてください。

# bar_chart_legend_label
source: category
ja: 項目

# bar_chart_x_label
source: month
ja: 月

# bar_chart_y_label
source: price
ja: 金額

# cancel_button_title
source: Cancel
ja: キャンセル

# category_entertainment_name
source: Entertainment
ja: 娯楽費

# category_food_name
source: Food
ja: 食費

# category_picker_all_title
source: All
ja: すべて

# category_picker_label
source: category
ja: 項目

# category_sub_none_name
source: None
ja: なし

# category_sub_picker_label
source: sub category
ja: サブ項目

# close_button_title
source: Close
ja: 閉じる

# entertainment_sub_goods_name
source: Goods
ja: 雑貨

# entertainment_sub_luxury_name
source: Luxury
ja: 嗜好品

# entertainment_sub_traffic_name
source: Transportation
ja: 交通費

# felica_session_error_message_invalid
source: This device is not supported.
ja: こちらの端末ではご利用できません。

# felica_session_error_message_unavailable
source: This card cannot be read.
ja: こちらのカードは読み取ることができません。

# felica_session_scanning_message
source: Scanning
ja: スキャン中

# fetch_button_title
source: Fetch data
ja: データ取得

# food_sub_drink_name
source: Drink
ja: 飲料

# food_sub_grocery_name
source: Grocery
ja: 食品

# food_sub_supplement_name
source: Supplement
ja: 栄養補助

# food_sub_sweets_name
source: Sweets
ja: 菓子

# form_date_title
source: Date
ja: 購入日

# form_name_title
source: Name
ja: 品名

# form_price_title
source: Price
ja: 金額

# item_validation_name_empty_message
source: Please enter the item name.
ja: 品名を入力してください。

# item_validation_name_length_message
source: Please limit the item name to 30 characters.
ja: 品名は30文字以内にしてください。

# item_validation_price_empty_message
source: Please enter the price.
ja: 金額を入力してください。

# loading_fetch_message
source: Fetching data
ja: データ取得中

# loading_register_message
source: Registering data
ja: データ登録中

# month_display_mode_chart_name
source: Pie chart
ja: 円グラフ

# month_display_mode_list_name
source: List
ja: 一覧

# month_display_mode_picker_label
source: display
ja: 表示

# month_picker_label
source: month
ja: 月

# month_sort_type_date_name
source: Date
ja: 購入日

# month_sort_type_picker_label
source: sort
ja: ソート

# month_sort_type_picker_value
source: %@ order
ja: %@順

# month_sort_type_price_name
source: Price
ja: 金額

# no_data_message
source: No data
ja: データがありません

# ocr_read_button_title
source: Scan
ja: 読み取る

# pie_chart_legend_label
source: category
ja: 項目

# pie_chart_sector_label
source: price
ja: 金額

# price_value
source: %@ yen
ja: %@ 円

# read_ic_card_button_title
source: Scan IC card
ja: 交通系ICカードを読み取る

# read_receipt_button_title
source: Scan recipt
ja: レシートを読み取る

# register_button_title
source: Register
ja: 登録する

# show_register_button_accessibility_label
source: show register screen
ja: 登録画面表示

# sort_button_ascending_accessibility_label
source: sort ascending
ja: ソート昇順

# sort_button_descending_accessibility_label
source: sort descending
ja: ソート降順

# tab_month_title
source: Month
ja: 月

# tab_year_title
source: Year
ja: 年

# update_button_title
source: Update
ja: 更新

# year_picker_label
source: year
ja: 年
